"""
3. Напишите программу, в которой пользователь будет задавать две строки, 
программа - определять количество вхождений одной строки в другой.
"""

str_1 = input('Введите 1-ую строку: ')
str_2 = input('Введите 2-ую строку: ')

print(str_1.count(str_2))
